/****************************************************************
 *                       RISC_DSP project                       *
 *                                                              *
 *    Демонстрирует работу с DSP-ядром.                         *
 *    Вообще-то у NVCom-01 два DSP-ядра, но работа с ними       *
 *    полностью идентична. Поэтому здесь работаем только с      *
 *    ядром DSP0. Ну и, разумеется, с CPU-ядром -               *
 *    для управления DSP-ядрами                                 *
 *                                                              *
 ****************************************************************/

#include "nvcom_01.h"

// Адрес начала программы DSP-ядра
extern int Start_DSP;
extern float InA;
extern float InB;
extern int InC;
extern float OutC;

main()
{

// Останавливаем ядро 0
      DCSR(0)  = 0;
      SR(0)    = 0;

// Пишем в счётчик команд ядра 0
      PC(0)=((unsigned int)&Start_DSP - 0xb8440000)>>2;//(unsigned int)&PRAM)>>2;

// Пишем в первый сегмент памяти даннных XRAM
      A0(0)=((unsigned int)&InA - 0xb8400000)>>2;//(unsigned int)&XRAM)>>2;
      A1(0)=((unsigned int)&InB - 0xb8400000)>>2;
      A2(0)=((unsigned int)&InC - 0xb8400000)>>2;
      A3(0)=((unsigned int)&OutC - 0xb8400000)>>2;


// записываем значения входных переменных в память DSP-ядра
      float percents = 1.03;
      float sum = 10000;
      int years = 5;
      InA = percents;
      InB = sum;
      InC = years;


// Запускаем ядро 0
      DCSR(0) = 0x4000;

// ждем окончания процедуры
      while( !(QSTR_DSP & (1<<3)) ) ;

// забираем результат
      sum = OutC;

// "лишний" оператор для установки контрольной точки, чтобы посмотреть значения переменных
      while (1) ;
};
